In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'impares' : [1,3,5],
    'pares' : [2,4,6]
})
df

   impares  pares
0        1      2
1        3      4
2        5      6

In [3]:
array_np1 = df.values
array_np1

array([[1, 2],
       [3, 4],
       [5, 6]])

In [4]:
array_np2 = df.to_numpy()
array_np2

array([[1, 2],
       [3, 4],
       [5, 6]])

In [5]:
np.sqrt(df)

    impares     pares
0  1.000000  1.414214
1  1.732051  2.000000
2  2.236068  2.449490

In [6]:
np.max(df)

np.int64(6)

In [7]:
df_desde_np = pd.DataFrame(array_np1)
df_desde_np

   0  1
0  1  2
1  3  4
2  5  6

In [8]:
df_desde_np2 = pd.DataFrame(array_np1, columns=["col1", "col2"])
df_desde_np2

   col1  col2
0     1     2
1     3     4
2     5     6

In [9]:
mi_dataframe = pd.DataFrame({
                'Frutas' : ["Manzana", "Banana", "Cereza"],
                "Cantidad" : [5, 8, 3]
                })
mi_dataframe

    Frutas  Cantidad
0  Manzana         5
1   Banana         8
2   Cereza         3

In [13]:
filtro = mi_dataframe['Cantidad'] > 4
mi_dataframe_filtrado = mi_dataframe[filtro]
mi_dataframe_filtrado

    Frutas  Cantidad
0  Manzana         5
1   Banana         8

In [15]:
array_filtrado = mi_dataframe_filtrado.to_numpy()
array_filtrado

array([['Manzana', 5],
       ['Banana', 8]], dtype=object)